app/views/projects/_form.html.erb

SELECT "users".* FROM "users" WHERE ("users"."coordinator" = 't')
---
  <td colspan=2>
    Coordinador: <%= collection_select :project, :coordinator_id, User.find_all_by_coordinator("t"), :id, :username, :include_blank => true, :selected => @project.coordinator %>