app/controllers/accounts_controller.rb

SELECT "users".* FROM "users" WHERE (username LIKE '%%' AND nombre LIKE '%%' AND apellido_paterno LIKE '%%' AND apellido_paterno LIKE '%%') ORDER BY apellido_paterno
---
  def index
    @accounts = User.search(params[:username],params[:nombre],params[:apellido_paterno],params[:apellido_materno])

SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
---
  def show
    @account = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
---
  def edit
    @account = User.find(params[:user_id])

SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
DELETE FROM "users" WHERE ("users"."id" = 2)
---
  def destroy
    @account = User.find(params[:user_id])
    @account.destroy