app/controllers/activities_controller.rb

  def index
    @project = Project.find(params[:project_id])
    @activities = @project.activities.all
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 5) LIMIT 1
SELECT "activities".* FROM "activities" WHERE ("activities".project_id = 5)

  def show
    @project = Project.find(params[:project_id])
    @activity = Activity.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 5) LIMIT 1
SELECT "activities".* FROM "activities" WHERE ("activities".project_id = 7) AND ("activities"."id" = 8) LIMIT 1

  def new
    @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 5) LIMIT 1

  def edit
    @project = Project.find(params[:project_id])
    @activity = Activity.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 5) LIMIT 1
SELECT "activities".* FROM "activities" WHERE ("activities".project_id = 7) AND ("activities"."id" = 8) LIMIT 1

  def create
    @activity = Activity.new(params[:activity])
    @activity.project_id = params[:project_id]

    respond_to do |format|
      if @activity.save
---
INSERT INTO "activities" ("project_id", "hora", "nombre", "comment", "fecha", "actividad", "duracion", "valor", "updated_at", "created_at") VALUES (7, '2011-03-13 11:00:00.000000', 'Actividad 2', 'ksdnkadnkdaknnadsa', '2011-03-13', 1, '2011-03-13 02:00:00.000000', 20, '2011-03-13 18:51:56.323180', '2011-03-13 18:51:56.323180')

  def update
    @activity = Activity.find(params[:id])

    respond_to do |format|
      if @activity.update_attributes(params[:activity])
---
SELECT "activities".* FROM "activities" WHERE ("activities".project_id = 7) AND ("activities"."id" = 8) LIMIT 1
UPDATE "activities" SET "nombre" = 'Actv172782', "updated_at" = '2011-03-12 06:50:15.902044' WHERE ("activities"."id" = 2)

  def destroy
    @project = Project.find(params[:project_id])
    @activity = Activity.find(params[:id])
    @activity.destroy
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 5) LIMIT 1
SELECT "activities".* FROM "activities" WHERE ("activities"."id" = 2) LIMIT 1
DELETE FROM "activities" WHERE ("activities"."id" = 2)