app/controllers/members_controller.rb

  def show
    @member = Member.find(params[:id])
---
SELECT "members".* FROM "members" WHERE ("members"."id" = 1) LIMIT 1

  def create
    @member = Member.new(params[:member])

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("user_id", "team_id", "created_at", "updated_at") VALUES (1, 2, '2011-04-04 19:27:45.075985', '2011-04-04 19:27:45.075985')