app/controllers/projects_controller.rb

  def index
    @projects = Project.order("fecha DESC").where(:fin => false)
    if can? :manage, Project
      if current_user.admin?
        @projects_fin = Project.order("fecha DESC").where(:fin => true)
      else
        @projects_fin = Project.order("fecha DESC").where(:fin => true, :coordinator_id => current_user.id)
---
SELECT "projects".* FROM "projects" WHERE ("projects"."fin" = 'f') ORDER BY fecha DESC
SELECT "projects".* FROM "projects" WHERE ("projects"."coordinator_id" = 1) AND ("projects"."fin" = 't') ORDER BY fecha DESC

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def edit
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1

  def create
    @project = Project.new(params[:project])
    @coordinator = User.find_all_by_id(params[:project])
    @project.coordinator = @coordinator

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("updated_at", "fin", "nombre", "fecha", "created_at", "min_de_actv") VALUES ('2011-03-12 07:04:15.031460', 'f', 'Sembrando Valores', '2011-03-16', '2011-03-12 07:04:15.031460', 4)

  def update
    @project = Project.find(params[:id])
    coordinator = User.find_by_id(params[:coordinator_id])
    @project.coordinator = coordinator

    respond_to do |format|
      if @project.update_attributes(params[:project])
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 7) LIMIT 1
SELECT "users".* FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "projects" SET "updated_at" = '2011-03-15 04:27:24.964622', "descripcion" = 'En el proyecto Liderazgo los alumnos de SSC ofrecen pláticas en escuelas de primaria, secundaria y preparatoria sobre temas de actualidad para jóvenes, corresponde a éste semestre los temas Superacion y Motivación Personal, Valores; se organizan equipos de 5 personas para coordinar las pláticas; las actividades incluyen una reunión con el Director de la escuela para ofrecer la plática; identificar lo que ellos necesitan para sus alumnos, adecuar y desarrollar la plática con una presentación, ejemplos, videos, dinámicas e información para los alumnos. Los alumnos de SSC coordinan con el Director los días y horas. ', "horas_udem" = 240, "horas_tec" = 120 WHERE ("projects"."id" = 8)

  def projend
    @project = Project.find(params[:project_id])
    @project.fin = true
    @project.save
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 3) LIMIT 1
UPDATE "projects" SET "updated_at" = '2011-03-12 04:21:31.051274', "fin" = 't' WHERE ("projects"."id" = 3)

  def destroy
    @project = Project.find(params[:project_id])
    @project.destroy
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 1) LIMIT 1
DELETE FROM "projects" WHERE ("projects"."id" = 1)

	def add_user

		@project = Project.find(params[:project_id])
		@user = current_user
		@project_user = ProjectUser.new(:project_id => @project.id, :user_id => @user.id)

		project_users = ProjectUser.where(:user_id => @user.id)
		same_month = false

		project_users.each do |pu|
			a1 = @project.fecha.month
			a2 = Project.find(pu.project).fecha.month
			b1 = @project.fecha.year
			b2 = Project.find(pu.project).fecha.year
			puts "#{a1} == #{a2}"
			puts "#{b1} == #{b2}"

			if (a1 == a2 && b1 == b2 && !same_month)
				same_month = true
			end
		end

		respond_to do |format|
			if (same_month)
				format.html { redirect_to(projects_url, :notice => "Ya tienes otro proyecto en ese mes") }
				format.xml  { head :ok }
			elsif (@project_user.save)
---
SELECT "projects".* FROM "projects" WHERE ("projects"."id" = 7) LIMIT 1
SELECT "project_users"."id" FROM "project_users" WHERE ("project_users"."user_id" = 3) AND ("project_users"."project_id" = 7) LIMIT 1
SELECT "project_users".* FROM "project_users"
SELECT "users".* FROM "users" WHERE ("users"."id" = 3) LIMIT 1
INSERT INTO "project_users" ("created_at", "updated_at", "project_id", "user_id") VALUES ('2011-03-23 21:18:39.364703', '2011-03-23 21:18:39.364703', 7, 3)