app/controllers/projects_controller.rb

SELECT "projects".* FROM "projects" WHERE ("projects"."fin" = 't')
---
  def index
    @projects = Project.find_all_by_fin(false, :order => "fecha DESC")